# Дан символ C. Вывести его код (то есть номер в кодовой таблице).

c = input('Введите символ:   ')
print(ord(c))